CalPlug/Microsemi_SmartFusion2_DigikeyBoardDemo/Espressif_ESP8266-ESP32_Applications/ESP8266/ESP8266_web_interface/libraries/ESP8266WebInterface.cpp
#include <ESP8266WebInterface.h>

template <typename Generic>
void WebInterface::DEBUG_PRINT(Generic txt)
{
  if (mode ==_DEBUG && txt != NULL)
  {
    Serial.print("*WI: ");
    Serial.println(txt);
  }
}

WebInterface::WebInterface()
{
	updateHomePage();
}


String WebInterface::headerPage()
{
	String tempPage;
    tempPage =  "<h1>Microsemi/Digikey Demonstration Board</h1>";
	tempPage += "<p>Espressif ESP2866/ESP32 Web Server</p>";
	tempPage += MICROSEMI_LOGO;
	tempPage += CALIT2_LOGO;
    tempPage += "<p>Microsemi Innovation Laboratory, UC Irvine/Calit2</p><br>";
	return tempPage;
}


void WebInterface::updateHomePage()
{
	homePage =  headerPage();
	homePage += "<p><b>Inputs to send:</b></p>";
	homePage += "<p><b>-------------------------------</b></p>";

	for(int i = 0 ; i < 2;i++)
		homePage += "<p>LED"+String(i)+" <a href=\"LED"+String(i)+"_ON\"><button>ON</button></a><a href=\"LED"+String(i)+"_OFF\"><button>OFF</button></a></p>";
  	
  	//homePage += "<p><a href=\"/\"><button>REFRESH LOOP</button></a></p>"; //example: from static page to refreshing page if refreshing is disabled
  	homePage += "<p><a href=\"RESET\"><button>ESP RESET</button></a></p>";
  	homePage += "<p><b>-------------------------------</b></p>";
  	homePage += "<p><b>Messages to report:</b></p>";
  	homePage += "<b>-------------------------------</b>";
  	homePage += "<p>Message Text: "+message+"</p>";
  	//homePage += "<p>WiFi Status: "+wifistat+"</p>";
  	homePage += "<b>-------------------------------</b>";
  	/*Example of <svg> embedded in html. Remember \" is the escape character for " in html*/
  	//homePage += "<img src=\"data:image/svg+xml;utf8,<svg xmlns='http://www.w3.org/2000/svg' xmlns:xlink='http://www.w3.org/1999/xlink' version='1.1' id='Layer_1' x='0px' y='0px' viewBox='0 0 37 37' enable-background='new 0 0 37 37' xml:space='preserve' height='37px' width='37px'><g><path d='M25.785,5L14.5,16.566l-5.286-5.01L5.5,15.271l9,8.729l15-15.285L25.785,5z'/></g></svg>\">";
    //homePage+="<img src=\"data:image/jpeg;base64,/9j/4AAQSkZJRgABAAEAYQBhAAD//gAfTEVBRCBUZWNobm9sb2dpZXMgSW5jLiBWMS4wMQD/2wCEABUODxIPDRUSERIXFhUZHzQiHx0dH0AuMCY0TENQT0tDSUhUX3lmVFlyW0hJaY9qcn2Bh4mHUWWVn5OEnnmFh4IBFhcXHxsfPiIiPoJXSVeCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgoKCgv/EAaIAAAEFAQEBAQEBAAAAAAAAAAABAgMEBQYHCAkKCwEAAwEBAQEBAQEBAQAAAAAAAAECAwQFBgcICQoLEAACAQMDAgQDBQUEBAAAAX0BAgMABBEFEiExQQYTUWEHInEUMoGRoQgjQrHBFVLR8CQzYnKCCQoWFxgZGiUmJygpKjQ1Njc4OTpDREVGR0hJSlNUVVZXWFlaY2RlZmdoaWpzdHV2d3h5eoOEhYaHiImKkpOUlZaXmJmaoqOkpaanqKmqsrO0tba3uLm6wsPExcbHyMnK0tPU1dbX2Nna4eLj5OXm5+jp6vHy8/T19vf4+foRAAIBAgQEAwQHBQQEAAECdwABAgMRBAUhMQYSQVEHYXETIjKBCBRCkaGxwQkjM1LwFWJy0QoWJDThJfEXGBkaJicoKSo1Njc4OTpDREVGR0hJSlNUVVZXWFlaY2RlZmdoaWpzdHV2d3h5eoKDhIWGh4iJipKTlJWWl5iZmqKjpKWmp6ipqrKztLW2t7i5usLDxMXGx8jJytLT1NXW19jZ2uLj5OXm5+jp6vLz9PX29/j5+v/AABEIANwBuAMBEQACEQEDEQH/2gAMAwEAAhEDEQA/AOxoAKACgAoAKACgAoAKACgAoAKACgAoAKACgAoAKACgAoAKACgAoAKACgAoAKAG0tAsLRdAFArhTGFK6AQuoOCwB9M0uYYhfBwASfpRzCsOFUgFoAKAEoAKACgAoAKACgAoAKAFoAKACgAoAKACgAoAKACgAoAKACgAoAKACgAoAKACgAoAKACgAoAKACgAoAKACgAoAKACgAoAKACgAoAKACgAoAaSAMk4FTJpBYj+0Rk4Ulj7DNZ+3iiuUA8hP+rwPUmjnqP7NvmGguyQtkyYHoFo5aj+1b5CuiO5ngs4zNcSbEHGST/KtFATkZ58RaXG2EZiD1KxkVoqLIdRFyz1O0v2K20wdlGSuCDj8aThYpMuUhi0ANZgqlmIAHcmgCFry2X71xCPq4osLmIzqlgvW9t/wkBp8rDmGHWdPU4N3F+DZp8jFzIadc01et2n4An+lHIw5kJ/b2mf8/S/kf8ACjkYcyFXXNNb/l7T8cijkYcyHrq+nt0vIfxbFLkY+ZEqX1o/3LqBvpIDS5Q5idWDDIII9qBjqACgAoAKACgAoAKACgAoAKACgAoAKACgAoAKACgAoAKACgAoAKACgAoAKACgAoAKAEpbAFGoCCi/cNRaL9g0ELBRknA9TSclHdjsQPdRqcA7j6LzWEsTTRShcQSTOf3ce0er1KqTn8EfxHyxQvlSPzJKR7JxTVOb+KX4C5kh6wRqPuhj6tya0jQjHYTmyrc6zYWqEvcIxH8KHcf06fjXRGEmZucepHDfXV8oazt/Jj4PmXIIz9AOv1zRZINx2p3n9mWj3DOzu3yxrj5Q2PT04pxjzMJPlRxVzcy3czSzOWYnuc4HoPauhRsc7IqskfDLJBKskTlHU5BB5FTJaDW56QK4zqWwtAxKAKN3pNldqwkgQMed6gK2fXNUpWJcTA1DwxNAHktH82NRnYfv/h61rGqZOmYbo0bFHUqynBVhgitk7mbVhtNqwlqFABQAUnvfuNMfFE80ixxruZugqatRUlzBGNzobPSoLdAZFWWTuWGQPoK+fxONnVl7r0PSpUYrYvLlB8vygenFcXNyu6ZtyjxNIORI351pGtUTvcXs0OlvLoQnyfLMnbeDj9K6aOLanaZnKlcoweKosFbq3kRwcHZz/PGK9n2d0pI4lU1szVtNVsrvHlXCbjwEY4bP0NQ4tFqSbLtSUFMBaACgAoAKACgAoAKACgAoAKACgAoAKACgAoAKACgAoAKACgAoASgBkkqRj5mArOVVR3GkV3vUBwilv0rlljV9hXNVSl1EH2qQ9kU1P7+r5fcJ8iHraDrIzOfc1qsNf43f8CefsTJEifdUD6Ct40ow+FWJuU7vWLGzcpLON4/hUFj+nT8a1VNy6EOSRiXfiuV1K2sAjPZ3OT+X/wCutlStuZurEzTe6lqcwh8+WRn42A7QfwGBV8kYEc0nudDpXh2G0XzLoJPMexHyr9PX61jOo3saqC6m2Bis9y0rGB4vjY2MLgnasnzD6jg/59a0paMzqao5Ouq5iFAGnoWlNqFyHkU/ZkPzn1P92spy0LitTuK5UdAtMAoAazBFLMQABkknpRYBscqSoHjdXU9GU5BosK5Vv9Ltb9D50Q34wHHDD8f6VSm4icbnH6ppU+mS4k+aNjhJB0P4dq6YS5jCS5SjVkBQAUb6BY29BtgsbXDKMk4Q+g7/AOfavDzCu37nb/gHdh4XNfPcmvL12ijsbSWhz13q9w87+RJsiB+XAHPv0r36GBpwp881/X3nnVK009DS0i9kuoXEpzIh5OMZB6V5uOw8Kc7wen/DHTh6jmi/XDbodK3OZ1dQupTAADoePoK+mwLcsOpP+tTysQkp6FOurS5jZ3L9prV/aMNs7OuRlZDuBHpz0/CodNM05zpNL8QW98wikHkzE4VSchvxxWEqbNIyNmoNAoAKACgAoAKACgAoAKACgAoAKACgAoAKACgBKACkAUaPcQxpEj+8wH1NROrGHxMpJsrPfAcIpJ9T0rjljorZGqpdyPNzOe6j8hWN61X4f0H7sSWOxUcuST6DpW0MGt6gpVGyykap91QPoK7YwjHYyuQXN/a2gPnzohAztLckew61pyyexHMYd54rUDFnDk92lHH5A1oqRm6hiXep3l4zGadyrfwKcL+VbKCRm5FSrtcnYmtLWW8nWGBSWPfso9T7VLlylKPMdvpWmxaZb+WnLtgu3cn/AArllK50RjYvVKKFoAY6q6FHUMrDBBGQRQBkT+GLGaRnHmxZ/hQgD9RWiqyM/ZjrXw3YW8m8q8x7CQggfgAKTqSGoGqiLGgVFCqowABgAVBdh1ABSAxtU8Q29mpSArNP2A5VT7n/AA/StI02zNzOVvL64vZS88jNzkLn5V+grphGyMZO7Op8KW/laX5ucmVyfoBx/Q1z1HqbwWht1mWRyRJNGUkRXQ9VYZBoA4vWtHfTZN6Za3Y8N/d9jXTCfMc7jymXWtjMKSdwHxyyxf6uR0/3WIqZUkylKxMuoXQjaMzMysCDu56+9Y/VaLd+vzLVZpWK1dGqXLEzV07o6PR7Zra1y67Xc5IPUDt/n3r53HVlWqWjt/wx6WGp2V2X64Wvs9Te+tmcrfzLcXskq/dJ4/AYr6jDUuTDpf1ueVWldleumWtjN7BQIKAN3Q9ee2kWC7dnhPCseSh+vpWE6ZtGZ1iOroGRgysMgg5BFYbGydx9ABQAUAFABQAUAFABQAUAFABQAUAFACUAIzBRliAPc1LdgK8l5GgwnzH8q5Z4unDY0jSZWa4mlJC5A9FFccsTVqP3TVQitx0dk5++dn61VPBS+0wdZLYtR28cfKrz613woU4bIwc3IfJIkMZeR1RR1ZjgCt1dkmVeeJbK3UiFjcSA42rwPz/wzWipyZm52MC98Q310zBJDBGeip1H49a1VJGbmZdaq8SGwpCCgdx0cbzSLHGpdm4AAyTQ3yjWp3Oj6aum2gjODK3LsB1Pp9BXLKV2dEY2NCosUFAC0AFAEcskcMZeV1RB1ZjgCjULmLdeKbSKRVgR5l/iYfKB9M9a1VNszlUsbUUiyxrIudrAEZ9DWTLRBe39vYx755AvGQv8TfQU0rg2cpquvz34MUY8qAjBXqW57n+lbxp2MZTMmtdjPcUKWYKoJJOAB3ob0Etz0W1gW2to4U+6ihRXG3dnWtiakMKAIpYkmieJxlHUqR6g0LQGrnD6zpzadeMm0+SxJjb1Hp+HSuqnLmOaa5ShWhCClZg0OjRpHCRqWY9AKU5Kmry2GrS0N7TdLFviWbBl6gf3P8a8HF41VPdgehRoqnrI0uled10OnzRj6vqSlDb27A54dh/KvYwODtLnqf1ucdet0Ri17N9OU4rXCkgCmIKAChO4PQ6HwtqZjl+wyt8jcxk9j6fj/nrXPVibwZ1dYmoUAFABQAUAFABQAUAFACUAFK7AKVu4DHkVBlmAqZVIx3HZlSS+zxGuPrXBUxz+ybRo23K+ZJmx8zH+Vcnv1fM1tFFmKx7yH8BXZSwa6mUqty2kaoMKoH0rvjBQ2MWyOe6gtVDTzRxg9NzYz9K0SbJbSMC98VgfLZQ5OeWlHH4AGtY0b7mTqWMC5vbm7bNxM8nOcE8D6DoK1UbGdyCrJsFABQAUrggpgzp/Cum7V+3SgEsMReo6gmuapK5tTjY6SsjYKLAFABSvcDN1PWbbTlIJ8ybtGpGQcd/QdKuMLkOdjktQ1O51B8zPhB0jXIUfh610RhYxcrkVhB9ovoISpYO4BA9M8/pVTdkTBanR6r4jS2LW9koaRDtLEfKPpWEKdzaU7HMSyyTuXldpGPdjk10WsYt3GUxBQA+CUwTxyqAWRgwB6Eg5pNXGnY2f+Ervv+eVv/3y3+NY+xNFVsH/AAld9/zyt/8Avlv8afsV3D2gf8JXff8APK3/AO+W/wAaPYruHtA/4Su+/wCeVv8A98t/jS9kHtLm3LanWNFTzxGJpEDqyjhSeR1/I1mnys0tdHFOjRuyOpVlOCD1Brqv9xgkktR9vbyXMojiUk9z2H1rKpWVNXlsFODqM6OwsI7OPs0p+8+P0HtXz2JxMq+i2PTp0409EWWYIpZiAB1JOAK5oxu+U1tbUwtS1UzZhtyRH3boW/8ArV7uEwEoaz/r8Tz6tZyMuvSutkjmfMFMQUAFABQAUDFVijBlJVgcgg4INID0W2mW4t45l+66hh+NcTR1ImoGFABQAUAFABQAUAFACUARyTJH95gPasp1VDcaRUlvWbiMbff1rzqmMe0TeNK25Asckpyqlj3Nc0acqmq1NHKMS1FYgYMhz7Cu+lg1H4tTGVa+xaVQgAUYAruUYx2MW2yvd6ja2Snz50Uj+HOWP4datJy2JcrHOX3imeUFLNPJGfvnBJH06Ct1Ra3M3UMN3eRy7szseSzHJNa2RnqNoFcKbYgpILhTAKAChICeytmvLuOBQfnYAkDOB3NRJ2KSPQYYlhiSJBhEUKo9hXIdSH0AFK4ENzdQWkfmXEqxr/tHr9PWqsI5fVfEk05MVmWijBIL55Yf0raNIylMwq2SsZbhQ2Kxu+EYC9/LKVBWOPGfQk8foDWNVmtNG5PoWnTu8jwYdzkkMRz+eKyVRo1cEzm9e0mPS3iMUjMkucBhyMY79+tbwlzGMocplVqZhQBJBBLcSrFChd26ACk3YaVzbtfCk8ke64nWFj/CF3Y+vNZOtY0VK5N/wh//AE/f+Qv/ALKl7byH7IP+EQ/6fv8AyF/9lR7XyD2Qq+EQGBa8yAeR5WM/rS9sHs7HSKoRQqjAAwKw3Ntjmdc0ZptSWWEBI5RmRvRvp7im8SqMfe3M/Yub0LNtbx2sIjjGAOp9T614NWtKrK7PQjFRViRjtXOCQOwrKybsVpa5h34v7yQ/uJFiB+Vf6mvcwzw1KNlq++p59TnqO0Sp/Z13/wA8Hrq+tUXrzfgzL2MiKa3lt8ebGU3dM962p14VNIMmcJRIq1ICgAoAKACgYUAdz4cJbRLck54Yf+PGuOe50Q2NOpLCgAoAKACgAoAbUtvoGwjyLGpZjgUpzjBXY0mylNeluIxgeprz6uMurQNoUu5XVXlbAyzfWuJRc5W6mzkoluGyC8yHJ9B0r0KWD5PiMJVWy2FCjAAA9q7lFLYxuQXV3BZwmW4kCIPXqfoKpJyE2onNan4mlmBisgYkI5dvv/hzxW8aVtzGVS+xhySPK5eR2dz1LHJNbGY2mAUCCgAoAKACgAoAKAZ0nhC0y014TwP3YH5E/wBK56z6G0EdRWJsFAFXUJp4LOSS1i82UD5V9eaaSJbOEvLi5uJibt3Zx/C3G36DtXVGyMJXIKsgKACkD3Ow8KWoi00z/wAUzE/gCQP6/nXNVd2dEFobdZls5DxZdebqC246QLz9Tg/yxXRSVtTGqzDrYyCgDsfDWnC1shO4UyzAMGHZTggf1rlqSuzojGxtVmaC0AFABQAUAQXKeZCw7gZH1rCvDmhqVB2Zm14O2jOvmiJRcYUXAKa1GtDA15s3iLnhUHHocmvoMti1T/rzPOxCkzMr0jlCgAoAKACkwCmgO80OEwaRbI3XZu/M5/rXFLc6omhSKCgAoAKACgBKAKs12qDCYZv0FcVbFqGiNYUmyk7tI2WOTXlznKesjpSUSWG1eQ5bKrXTRwrn6Gcqli/HGsa4UYr06dKNJWiczlzDicDmtPQRi6p4igtVKWpWeXOOD8q/j3rWNNy3M5VLHKXNzNdzGWeQu57muhJIwbbIqb1EnYKYwoAKBBQAUAFABQAUAFEdhnb+HIvK0aHK7WfLH35OD+WK5JvU6IbGrUFhQAlACMoYEEAg9jRcVkee6iqrqNyqKFVZWAA6DmuuD0OaRXq2ShVBZgqgkk4AHejoPqei2sK21vHCn3UUKK4b3Z1JaEhIAyeAKXUfQ87vLlru7luH6u2ceg7Cu21onI3dkNUhMsWEH2m+ghKlg7gMB6Z5/Sok7FRPQgoUAAYA4ArjZ1C0wFoAKACgAoAb2pegM8+1GHyNRuIwu0LI20e2eP0rtjK8LI55ORWqrszCi7AKalzIewVEUlAWgVQBQAUAFABQBLa273dzHBGMs5wP8ahuxSR6KAFAA4ArkZ1DqACgBKNgClqA13VFyxwBUykoK8hpXKFxdGQ4Thf515NfFObtE6IU7EABJAHJNcsYuWiNW+Uu29pt+aQAnsOor1KGEUdWc06ly3XfcyIbq6hs4TNO+xBjJxmhRuJuxyWsa/LfExQbooPyZuOQcHp7V0QhYwlK5j1sZoKACgAoAKACgAoAKACgAoAKACk9hrc9IgiEMEcS/dRQo/CuNnUtiSkMKAEoAgvp/s1lPMMZRCwz644oSFJnnjMWYsxJJOST3ruOUSgDT8OW/n6xDldyx5dvbHQ/nis6jsi6aO4rk6nQZviC4NvpEzK21mAQfief0zVxV2TNnDV2dDmCk9wNvwpambUTP/DAv6kED+tZ1noXTR2Ncx0BQAUAFABQAUAJQBw/iQEa3PxjO0j/AL5FdNLY56hmVqZhQAUAFABQAUAFABQAUnqD1Oh8J2JaZr1wNiZRPXdxk/l/OsasuhtCJ1dYGwUAFACUuoEcsqwrlj+Hc1nVqqmtSkrmdNM0zZPA7CvGrVpVNzqjDlGBSzBVGTWcY82kSmzQt7cQ8k5Y969jD0FSWpyynzFjpXTZmdijqmpxaZbiSTLM3CIDyT/h71cY8xMnynG6jqM+ozmSVjtH3E7KP8966Yw5TByuVKsiwUDCgQUAFABQAUAFABQAUAFABQAUnsNbnpY6VxHUthaBhQAlAGF4tn2afHCGwZX5HqB/9fFaU1qZVHocjXUYhQB03hC1GJrsnnPlgfkT/Sues9TWCOlrE2Oa8X3QxDaAc58wn8wP61tRV9TKozma3MEFNDR2HhW1WHTTP/FMxJ+gJAH8/wA65ajuzemjcrM0CgAoAKACgAoASkBxvisAasPeNc/rXVS2OeoY1amYUAFABQAUAFABQAUAW9M0+XUroQx/KOrsf4RUSfKi4I7u3hS3gSGMYRFAFcl+ZnQtCagYUAFAEcsixIWas6lRQV2NR5jNmmaZtx4HYeleJVrOozqhHlGAFiAOSeBWcYuTsty2+U0baAQrk8sepr2aGHVJX6nLOVyeuozM/VtUj0yDcw3yN9xORu6Z5/GqjHmJlLlOKu7ua9uGmnbLH8gPQV0pWOdkNXckKACgAoAKACgAoAKACgAoAKACgAoAKl7Djuel9q4zqFoGFACUAcf4rujNqIgxhYB+ZYA/4V0UlbUwqMxK2MgoA7vQ7ZbbSoAvV1EjH3Iz/wDW/CuObuzpSNCpLOE166a61WYkYEZMaj2B/wAc11U1oc8mZ9WjMUAswUDJJwBS6DW56LbQJbW8cKfdjUKK5HqzqWxNSGFABQAUAFABQAlAHGeKXDauQP4Y1B/n/Wumlsc9Qx61MwoAKACgAoAKAChahsS2ttLdzrDAu527ZxUylylJXO40vTItMt/LQ7nPLvjBauWUrnRGNi9UlC0AFACE4oAzLmbzn4+6OleJia3tHodUI2Ia53ZrQ1bL9nBsXew5Pb0FerhKCirvc5Zz5i1XamZFXUL2PT7Rp5O3CjP3j2FVFXJk7HDX15Lf3TTynJP3R/dHYV1xjynPJ8xXqmSgoSBhQAUAFABQAUAFABQAUAFABQAUAFABS6B1PRLGcXVlDOP41BP171xy0Z1x2LFIYUANJAGScAUuomed3dw13dSTv1dicenoK7bWic02Q1SJZY0+D7TfwQlSys4DAenf9KiTsVE9DHAwK5DqIL6f7NZTTcZjQsM+uOKIrUTZ54zFmLMcknJNdyRy3EpIDT8OwefrEWVyseXPtjp+uKio7IqG53ArkOkWmAUAFABQAUAFACUAcN4hYNrdwQc8qPyUV1UtjnqGbWhmFABQAUAFABQBZsbGe/mEUCZP8THoo9SamT5SkrnZ6VpUOmw4T5pG+/IRyf8AAVyylc3jGxfqSwoAWgBKXmBVvZNkYQdW71x42pyw5e5pSjqUK8jd3Oq1ye1h82TJ+6vX3rpwtLnkZ1ZWRpV7aOUKSA4rxBqn2+68uNgYIj8pH8R7muqELHPKVzJrUzCgAoAKACgAoAKACgAoAKACgAoAKACgAoAKcdhnZ+F5fM0dUxjy3Zfr3/rXHNanRB6GzUFhQBmeILg22kTFW2uwCL+J5/TNVBXZMnZHDV2PY5luFJ7iN7wjBvvpZiARGmOexJ/wBrKs9DWmjra5zcwvFtx5enxwhsNK/I9VHX9cVpSWpnUehyNdRzhQB03hC1GJrsnnPlgfkT/Sueq9TakjpaxNhaACgAoAKACgAoAazBFLMcADJoF0PO7yUXF5NMM4eRmGfQmuuKsjmlqyGrJCgApAFMAo2Dc1NJ0OfUcSMfKgB+8Ry30H9aylUsaRgddZWMFjCI7dAoHU92+p71zt3NkrFmkULQAUAFADaS7CZm3Tbp25yBwK8TEy55nZTVkQ1z7I0WiNK0jCQD/a5r2sNBQhc4pu7J66iTO169NlpsjxsFlbCofc9f0zVQjdkSdjha6zmsFMYUCCgAoAKACgAoAKACgAoAKACgAoAKACgAoGzc8KXnk3rW7uAkq8A/3h0/TNY1UaQZ2Fc5uFAHMeMnbFqnO07j9TxW1FXMarsc1W5kFNAjsvDFn9m07zWUiSY7jkY4HA/wAfxrlqO7N6aNmsyzkPFlz5uoLbj7sK/qeT+mK6KKMarMOtjIKAO70O3S20qAJ/Ggdj6kjNccndnVFWRoVJQtABQAUAFABQAUAZXiK8+yaW4Ay037sfiDk/lVwV2TPRHEV1tWRyrcKACgAoAlt7ae6fZBE0jew6fX0qG7FJHUaZ4ZhgxJeYllBztB+Qen1/lWEqjZsoG8AAMCs9y9goGFAC0AFABQAlIDJl/wBa/wDvH+deDW/iHZT2EQbnUHuQKmmvfQ57GsBgCvoLanGLTEcz4yb/AI9Fz/fJH5f/AF63o7mNU5qtzEKACgAoAKACgAoAKACgAoAKACgAoAKACgAoAKBjopGhlSVDhkYMp9CKQHoNhdLeWcVwv8a5I9D3H55rjasdSZYpDKt9p9vqEYS4j3Y+6w4K/Q04yaJcUzEbwgNx23pA7Ax5/rWvtmZ+yLdh4bs7b5pv9IfPG8YUfh/jUyqtlRp2Nqs7mlgoA4TX336zcn0IH5ACuqnsc0tzPrQkKAPSYkEUSxr0UAD8K4TrHUALQAUAFABQAlABQBxHiC/+235VSfLhyg5yCc8n/PpXTTjY55My61ZmFJMdhyI0jBEUsx6KoyTQ7Bqb+m+F5HIkvjsAP+qHJI9yDxWMqpoqZ0draQWabLeJY174HJ+p71g2bJWLFAwoAKACgAoAKACgBKAMqdds7j3zXg11+8OynsJF/rU/3h/OppfGgnsa1e+9zjCmBzPjJcNaN/vj/wBBrejuY1Tmq3MQoAKACgAoAKACgAoAKACgAoAKACgAoAKACgAoGFAG34b1T7JP9mmcLDIchmOArf4GsasTSmzsK5zcKACgAoAKACgDg9cj8vWLlfVt35jP9a6qexzS3KFaEhQB6HYT/aLGCYkEugJx645/WuJnUixSGLQAUAFABQAlAGL4h1j7FD5Fu4+0P3BHyD39z2rSELmcpWOOrqMB8UUkz7Io2duwUZNJsLG7p/heaTD3reUhH3EPzfjxispVexoqdjobLT7awQrbx7c/ePUn6msG2zZJItUhhQAtABQAUAFABQAUAFACUbAUr+LBEgHXg15mMo/bN6UrFRSVYEdQc158XZpm8ldGsjBkVh3Ga+gjLmSkjiasx1WIoazp41GxaNQPMHzRk9j/APX6VUZWJkrnCMpVirAgg4IPautM5mJTAKBBQAUAFABQAUAFABQAUAFABQAUAFABQAUAFABQM67w5q/2qL7LcOTOg+Un+Mf4iuWpA3hI3azNAoAWgAoASgDk/Fll5dyl2ucS/K/sQOPzH8q3pysYzRgVsZBRcLGxoettpzeTNlrdjnjqh9R7e1ZTplwmdPb6rY3X+puYyfQnB/I1g00b3RaLqq7iwA9SeKVguinPrGnwcSXUefRTu/lVKEnsLmJLS8W7+aKOTyscSMNoP0B5/HFJoaLVIZmaxq8emw4GGnYfImenufarhHm3IlOxyUdvfarcPIiPNITlmPA/Pp+FdPu0zGzkbtl4VRCr3ku/jmNBgZ+v/wCqsXWf2TRUkjctrO3tE228KRjGDgcn6nvWLbl8RqkkT0gCmAtABQAUAFABQAUAFABQAUAJSeoIa6q4KsMg1M4qa5WCdjLmiMTlT+B9a8OtRcJcp205XRasZeDGx5HTNd2Dre7ys56i1LleiZBQBja5ogv1863CrcL1zwHHv71cJ2M5RORmhlt5DHNGyOOzDFdS1MHoR0xBQAUAFABQAUAFABQAUAFABQAUAFABQAUAFABQAqsyMGRirKcgg4INJjOt0LXVulFvdOFnGApPG8f41zzhY2jK5u1kai0AFACUAQ3VtHdwNDMoZGGOnT3HvQmJo5PUvDlzalntwZ4s8BRlwPcf4V0Rq9zF0zJlhlhbbLG8bejKQa15kZuIymFyeOxu5BmO1mYeqxkipc4odmzRtvDF/MA0nlwgno5+bH0FRKrDoWqbN6w8P2dk2/aZpOMNJg4+grF1JdDVRNWs7lEVx5/l4tzGHJ6vkgD6Dr+lUJso2+hWcUjSyhrmVurTfN+lNzvsLlTNFVCqFUAADAAqdSkrDWmjT7zgEds81lKqofENRbIHvkA+RSfrxXJPGr7JqqLZLbvI6bn4z0AFdNCfOrmclYmrYkWmAUAFABQAUAFABQAUAFABQAUARTRCVNrfgfSsp0lUVpFRlymdJG0EmDx3B9a8apSlRZ0qXMXre4Eq4PDjqK9WhXVQ55RaJ66LX3ICmBWvbG3vowlxEHA6diPoaadhNXOavvC9xD81o3nqTypwpA/rW6rXMnSsYskbwyGORGR1OCGGCK1TTMmmhlABTFcKQwouFgpiCgAoAKACgAoAKACgAoGFABQAUAFFhG7o/iKS22w3haSLgB+6D+tYzpXNY1LHUW9zDdRCWCRXQ9xXPqb3RNQFxaACgAoASgApaAFGgBTAQijULsa8iR8swH1qJThDdjSbIHvYx93LfpXNLGU1tqaKk2Qveuw+UBf1rlnjZv4S1SIXleT7zE+1cs6sp/EaxgkMrNXZWxatrXdh5OnYV6FDC82szCdTsaFeoc4UAFABQAUAFABQAUAFABQAUAFABQAlK4DXVXXDAEVMoJ/ENOxRltXj+aMkj9RXm1MJKGsDdVFPRj4LzHyy/TP+NXRxVtJEypdi4rBhkEEe1egmYi1QBQBHLDFOmyaNJF9HAIouxWRl3PhqwuHLqHhJ7Rnj8jVqqyXBGZP4SuFf9xPEyf7eVP6A1oqpDgZ0+iahbn5rZ3HrH838qv2iI5CrLbTwDM0EkY/2kIqlJMmxFVCCgAoAKACgAoAKACgAoGFABQAqqznCqWPoBmgCddPvGGVtLgj1Ebf4VDmkO1yaHRdRm+7aSD/fG3+dL2iHyGha+HtWg+eKeOBj1AkIP44FTKrFlKDR0Vit8qEXrQMexiB/XNYOxsi5SGFACUAISFGScD3pARtcxKMlwfoc1jLEQRSi2Qm+XHyqxP5VzyxsEWqTITeynptH4VzvGzZoqJC0sjZ3Oxz71zSrTfU0UYobWd10Kugo3AWj1EgVSzbR1NVCEpP3RPQ0IrVI+cZb1NezSw8Y7nK6jZYxXQiHqLTAKACgAoAKACgAoAKACgAoAKACgAoAKACgBKEBFLAkv3hz61hUoKe5UZNFb7NLCcwtmuP6vWpv3dfuRrzqXxEiXZU7ZkKn1raOJcdKisT7NP4SZJUf7rA10xmp7GfK1uPrTVCaQtAC0AJQAUANdEkXa6hh6EZoAqyaVYSfetIfwQD+VPmJ5SA+HtMJz9l/J2H9ar2khciD/hHdL/59v/Ijf40e0kHIg/4R3S/+fb/yI3+NHtZhyIP+Ed0v/n2/8iN/jR7WYciD/hHtL/59f/Ijf40e0kHJEP8AhHtL/wCfX/yI3+NHtJByRHJoOmJ0tV/Fif5mjmY+RE8em2Uf3LSAe+wVLbHyosIiIMIqqPYYqbjHUaAFHMg1DOKeoEZmjHV1/OsvaxW7HysYbuEfx/oazliaS6/mVyMja+UfdQn6nFYSx8Oiv/XoWqTInvXb7oC/rWM8bN/DoWqJG1xKwwXP4cVhPEVZbv8AIpU6a2Iq5733LvbYKeo9eooBJwoJPoKaXkK8Oo8QyH+Aj68Vr7Cq+hPtBBGB991A9jn+VNUbfE7C5mJ8gPdh+VRaC8/wHdsTPsBUNvoNIFVnO1QSacYObtEblymjbQCJcn7x6+1exQw/s1qck5cxPXUQLQAUAFABQAUAFABQAUAFABQAUAFABQAUAFABQAlABS1AToKYX7iMoZcMAR71Linugu+hE1rG3IBUjuvFYSw0HsrF87ARSIPklJ9n5ojRnD4ZfgLmj1JE3/xhfwNaxYh9aCCgAoAKACiwBS1AKNQCnqAdKNQGGaMdXUfjWftIj5ZCGeID76/nS9tEfLIjN5EO5P0FYyxdJdSvZsb9uj/utUfXaQ/ZMY1+f4U/M1m8f2X9fcV7FjPt0vog/CsnjpD9iRNcSt1cj6cVm8VVe7/I09mhpdm+8xP1NYSlOW4+RIbUadB6ChS33QT9BVqEnsg5khwhkJwEb8RWnspt6K5LmiVbKUj+EfU1ssHUe+hDrDhZFRmSRVFXHBNfEL2vYGitU5MhPsDmm4UI/F+oKVR7CedAq/JDk/7VQ61JfDH8R8k3uN+1SbcKFQf7IqHiqi+EapLqRM7N1Yn6msJVJS3dy1FIbWdh6CgEnABJ9BTUU9gukTx2cj4LfKPfrXbTwkpeX4mUqti7FAkQ+Uc+p616VOlGnsYSk2SVptuSLTAKACgAoAKACgAoAKACgAoAKACgAoAKACgAoAKAGkEjg4pANO8DgBj+VQ5NeYxglYD54mH05/lUKo18UbfMdgNzEDgtg+4Io+sUu/5hyDhNF/fX86r20OguUeGBGQa0TuFmLQKwGjUBNo9/zpJBcTaPf86GkHMI0eRwzD6Gpcb7DuRNbyHpOw/CsXQm9pfgVzDTayH/AJeG/L/69Q8NU/m/ArnXYYbSX/nrn6k1k8HU/m/Ar2i7DPsMvqv51n9SmP2sRPsMv+z+dL6lUH7WIfYZf9n86X1KoHtYiixk7lar6lMXtoiixbu4/Kq+of3vwF7ZDvsB/wCen/jtV9QX834f8EPbIUaeB1k/ShYDu/6+8XtmOFjGOrMa1WDghe1kBhtV4O0H3al7HDL+mHNMP9DT+6f1o/2eP9MPfYv2uBB8v5AYqvrVFbfqL2bGG/HaP8zWMsd2X9fcV7Eia9lP3cL+tYyxs2UqMUMa4lfgufw4rF4mo/tfgaKEURViXYOKaXmAoBJwBk0KN9hXSHrBK3SNvx4rVUKj2I9oiZLFz94hf1rojgpv4tCHWJkso1HzZY+9dUcHTXxambqMsKqoMKAB7V1JWMxaoBaACgAoAKACgAoAKACgAoAKACgAoAKACgAoAKACgAoAKAEpAFF7DChCGsisMMAfrUyhGW6Hcie1iYfdx9OKylh6cug+axGbFR912B9aweBXRlqqN+zXHaX/AMeNR9XqLZj54dhAl4vQk/iDU8mKW36DvTEM9yn3l/Sh168d/wBAUUxPt0vov5VP12S3K9kg+3S+i/kaPr0+wexFF8/dVo+vd0L2Iov2/uD86r6/5f19wew8xft5/wCeY/On9f8AL+vuF7HzE+3H/nmPzpfX/wC7+P8AwA9ihDfN2QUvr/8Ad/H/AIA/YIT7dL2C/lU/XZh7GIfbpfRfyo+uzD2MRDey/wCyPwpPHTGqURpuZj/GR9BUPFVWV7KIzzZP+ejfmazdao92PkiNLM33mJ+pqHNPcfLESpux2YUD1F/Ci0mGw5YZG6I1axoTfQh1EiQWkxP3MfiK0WEq/wAv4k+1iOFjJnkqK1WCmT7WJKtguPmck+1bLAwXUh1WSJaRL/Dk+9bxwtJdCXUZKqIv3VA+grVU4LYm7HVoiQpaoYUagFMBaACgAoAKACgAoAKACgAoAKACgAoAKACgAoAKACgAoAKACgAoAKACgAoAKACgAoASgAoAKAIzDG3VFP4Vk6UH0HzDTaQn+D9TWbwlJ9PzHzsT7JD/AHP1NL6pS7D9rMQ2UR/vD8aX1OkV7aY37Cn95qj6lDuHtWJ9gX++fyqfqMO/9feP2rD7AvZz+VH1Fd/6+8PbMPsC/wB9vyo+orv/AF94e2YfYE/vtT+ow/r/AIcXtWKLCMfxMar6lAPascLOIdVJ/Gq+p0u35i9rMX7JD/c/U1X1Sl2/MXtZirawj+AfjzTWGproLnY9Y0X7qgfQVooQQrj60EFABQAUALQAUAFABQAUAFABQAUAFABQAUAFABQAUAFABQAUAFABQAUAFABQAUAFABQAUAFABQAUAFABQAUAFABQAUAFABQAlJgFTdgFWAUBcKLDCiyAKBBQAUAFACVN2AUXYC1QCUxjqQgoAKACgAoAKACgAoAKACgAoAKACgAoAKACgAoAKACgAoAKACgAoAKACgAoAKAP/9k=\">";
  	//homePage += "<img src=\"data:image/png;base64,iVBORw0KGgoAAAANSUhEUgAAADIAAAAyCAIAAACRXR/mAAAAAXNSR0IArs4c6QAAAARnQU1BAACxjwv8YQUAAAAJcEhZcwAADuoAAA7qAaOKY3EAAAAkdEVYdENvbW1lbnQATEVBRCBUZWNobm9sb2dpZXMgSW5jLiBWMS4wMX7Qgw0AAAAZdEVYdFNvZnR3YXJlAHBhaW50Lm5ldCA0LjAuMTnU1rJkAAAHL0lEQVRYR+2YaUxUVxTHy5t5796ntS4EENey1AULtRqrVgS1iaPoWGsrKoskFNwQE6hNKoHRIX4QExNRhICIVahVi6C1hjHUJZpajBRLIVCp7IVBwHVYZuY9ag/MY5mZOyva9IP/nJBh5r57fnPuuefcO2+9/F/qDZYteoNli4aL9U+fhH9enezEApSenp7W1tZr166lpBxLkMliY7/avftruVyemZl5584vz58/hwF2E9uMBZ6Uypbk5CO+vos9PUcGBTMHDjBnv2cUCrqgQPxdDr1/P/piPXJzG7MqYPXp06dVKpUdcDZgwezNzc0xMTFOTqNDN6NbtxkNJ+Z4Ed8D5tBvVK/xIrVaVFDArF2LJ05wTTqQBHAQPGEiK2QtFsdzWVknnJ2dPl+HqqroPpoBFJPG8eKS+3jZJ9jzPc+rV69aHzbLWDAXJEpISMh4F3T2HMtxYgPfFk2jFR87hseOYWUyGcdxwrxmZRmrra3Nb7Hf3LmopoYx8GeD8VTxb9jdjQkNDVWr1RbDZgHr2bNnkNpLl6HHT2iuN2+M/Flt8HhDPePtjTaHhfE8b57MHBYEfMOGDR/NQ0+ewsJZlUyWjKpvQO7uaJ9cbj9WamqqqyuuraX79peBA3uNF98rRmNGj7hx44bghiSTWHV1dY6OYy/kYcN5h22wPY8eZb1mzerq6hKcGYmMBRGOjIwMDUUc90rWztA0GrH/Eubw4cOmlpKMVVtb6+z0dl0DYetBxSq6yxxNof98gKBsGnzabxR8n8KfUVoa3dgIkxBy4O5d5PauW3d3t+BSXwQs+AbQ2qJ3IY4nTPfjZUTTNOVAjXqHLi8nLzFsuuRkhhKJHByoCROR8hFkp9EYnlrzKc7NzRW86ouABRvQx8entJRcpYKDGXDm0CsqMdFE5vHUwoUwrG+QiD5zhhgw6vJPaOPGjdD0BcdDZIgFoaqpqZn9IWuqvSQlYR0WRVF5+cjgU8F4UUQE0mExDF1yn4zV0UnPmO6q0WgF30NEiNb58z9ERZFDBdbVxcTH4+XLccpRbKYRQamLihqxckVvvyLmls7WrMFl5WXGiU/ASkyUZ50g5+kQo/qKvoUxRu8YmkyGz58/ZxkLRmzbtu36dUKSvg47kcUkHTwIvUhw3y8C1qagoNLS/wgrP4+JT4jXag3Ti4AVFBT0hz4Wxzt0qy2viHmDSZ6/MMzFvDx6T9wejUYjuO8XAWv79h03b/Zj8WKoe0HBKCR4BN9j80lrqMEmmObJRkXh6mo8UIezTtKQysZFlYAlT5R/e0pIeTjPrAygp09nL+SygKibyz6D+hkSwq5ahb/ZA2dJAWvfPiYjIx1OYIL7fhGwoEDs2sX0fyH4SxUokHQ1FH1yJbPOqIcPkYcHVr2AdRjMh3Xr2MLCQquwoJzOmwfldPBhrVa0xJ+9V6w3o00GX+nLcHzkiF5X6OgUec10/ethleWUB8F29fH2qagcWrqooiK0dAlSq+3boaLCQrRgPu7q1ntcoUArAwKampqML0WEaIES5Ym7d+v1H3gtk7Fxe6BkD85rpdXVi7282N/1myysxvr16NChQ0+fPgWPgvt+EaIFgjPgeJeRSqVey1NrYCJ86jQk2eCbFq39Me3nh/Pz9FoQdIiSEjR5yuSSkhLi2YaMBfiREVsiIzGcJAfmAlOpaOlqnJKCINss5xlP1dbRixfjk1l6mQqm0YokEhwbGwv3YeMSDyJjgeob6h0dxykUho22s0scFsZuCGSbmmC3wkdEOIrTii5dwjNn4IsXdUxD84E6fpz18PQsLi7u7Ow0XkGQSSwYDVeMqVORUml4mtBy4vQM7OmBExJwVRVEDto2vN/Hx/furwIFszIA+/vh8nLa6ARLlZUxTk5sWlpaa2srMVQgk1ggeCYwMHCJP1Z1GBVSXvSoldkrQ9OmoRkzcWAgvWWLKDyclkiYqVOwRILy87FGS9i2zUrm/Vl4y9at1dXVZu6x5rBAcM1f9PEiqRS/UJFLg5YTPahC0NqyTjLZOcy166i9Xbe4hiMhTsoWev4CLF0traysNLV8OlnAgifb2tp9F/n6+6OmZrhYmyr0QzkITJBPFZW0jzcrlUorKio6OjrMMIEsYIHgeZVKtWlT0JQpqECBIbGIjk0bpeWo7Bzs7MLu2LED7lQQJ4s/KlnG0gnyLDPzhIuLc3g4/ruJNtjwJoyCCvfgAf3ZWtbd3SM7J7utrQ3OMObjpJO1WDoplcro6GhX13ExMRg2FITBCEUwtQaukyg8HE2a5BoXF9fY2Ah3aOt/trQNS6eWlhZoGpBwc+aMiopCGRmMQgHHMvrXIvrKFTo1lYmIRLM/GCeRrEhPT4fBECFbf0e1B0sncNPe3g7HkuTk5Pj4hJ07o6N3Rcv27k1NTbt16zZsYVh3W2kGZD+WTuBVJ+H/vneEV8PQcLFek95g2aI3WNbr5ct/AXGjjRaxnj8FAAAAAElFTkSuQmCC\">";
}

void WebInterface::startAP(char const *pw)
{
	WiFi.mode(WIFI_AP);

	// Do a little work to get a unique-ish name. Append the
	// last two bytes of the MAC (HEX'd) to "Thing-":
	uint8_t mac[WL_MAC_ADDR_LENGTH];
	WiFi.softAPmacAddress(mac);
	String macID = String(mac[WL_MAC_ADDR_LENGTH - 2], HEX) +
	             String(mac[WL_MAC_ADDR_LENGTH - 1], HEX);
	macID.toUpperCase();
	String AP_NameString = "ESP8266 - " + macID;

	char AP_NameChar[AP_NameString.length() + 1];
	memset(AP_NameChar, 0, AP_NameString.length() + 1);

	for (int i=0; i<AP_NameString.length(); i++)
	AP_NameChar[i] = AP_NameString.charAt(i);

	WiFi.softAP(AP_NameChar, pw);
}

String WebInterface::getHomePage(boolean refresh)
{
	String send = homePage;
	if(refresh){
		send += "<meta http-equiv='refresh' content='2'/>";
	}else{
		send +=  "<meta http-equiv='refresh' content='0; url =/' />";
	}
	return send;
}

void WebInterface::appendMessage(String s)
{
	message += s;
	updateHomePage();
}

void WebInterface::newMessage(String s)
{
	message = s;
	updateHomePage();
}

String WebInterface::getMessage()
{
	return message;
}

void WebInterface::updateWiFiStatus()
{
	/*Limits output buffer*/
	//wifistat = (WiFi.status() == WL_CONNECTED)? "connected":"not connected";
}

void WebInterface::readSerial()
{
	char s[BUFFER_SIZE] = {0};
	if(Serial.available())
	{
	    newMessage("");
	    for(int i = 0; Serial.available(); i++) {
	       s[i] = Serial.read();
	    }
    }
    appendMessage(String(s));
    DEBUG_PRINT(String(s));
}